public class _11_논리_연산자 {
    public static void main(String[] args) {
        // 논리 연산자 && ||
        // 조건식을 연결할 때 사용하는 연산자

        /* &&가 ||보다 우선순위가 높다. 따라서 괄호가 없으면 &&먼저 인식
        || (OR 결합): 피연산자 중 어느 한 쪽이 true이면 true를 결과로 얻는다.
        && (AND 결합): 피연산자 양쪽 모두 true이어야 true를 결과로 얻는다.

        x   y       x || y      x && y
        t   t          t           t
        t   f          t           f
        f   t          t           f
        f   f          f           f

        */

        /*
         (4). 문자 ch는 숫자('0'~'9')이다.
         - 사용자로부터 입력된 문자가 숫자('0'~'9')인지 확인하는 식은 다음과 같이 쓸 수 있다.

         문자:     '0'   '1'   '2'  '3'  '4'   '5'   '6'   '7'   '8'   '9'
       문자코드:    48    49    50    51  52    53     54    55   56    57

       (5). 문자 ch는 대문자 또는 소문자이다.
        */


// 논리 부정 연산자 ! ( 단항연산자 / not)
        // true를 false로, false는 true로 바꾼다.


    }
}
