public class _29_객체지향_언어 {
    public static void main(String[] args) {
// ch6-1 객체지향 언어
        // 80년대 초 소프트웨어의 위기 - 빠른 변화를 못쫓아감
        // 해결책으로 객체지향 언어를 도입(절차적 -> 객체지향)
        // 코드의 재사용성이 높고 유지보수가 용이, 중복 코드 제거
        // 객체지향 언어 = 프로그래밍 언어 + 객체지향개념(규칙)
        /*
        4대 핵심 개념:
            1. 캡슐화
            2. 상속
            3. 추상화
            4. 다형성

        */
//=====================================================================

// ch6-2 클래스와 객체
        // 클래스의 정의: 클래스란 객체를 정의해 놓은 것
        // 클래스의 용도: 클래스는 객체를 생성하는데 사용

        // 객체의 정의: 실제로 존재하는 것. 사물 또는 개념
        // 객체의 용도: 객체가 가지고 있는 기능과 속성에 따라 다름

//======================================================================

// ch6-3 객체의 구성요소 - 속성과 기능
        // 객체 = 속성(변수) + 기능(메서드)

        // 객체: 모든 인스턴스를 대표하는 일반적 용어
        // 인스턴스: 특정 클래스로부터 생성된 객체(예: TV인스턴스)

        // Q.클래스(설계도)가 왜 필요한가? -> A.객체(제품)를 생성하기 위해

        // Q.객체가 왜 필요한가? -> A.객체를 사용하기 위해

        // Q.객체를 사용한다는 것은? -> A.객체가 가진 속성과 기능을 사용하려고







    }
}
